W8D1/sub-reddit/reddit_clone/app/controllers/posts_controller.rb

  def create
    @subs = Sub.all
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save
---
SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "wild post"], ["url", "p.co"], ["content", "out here       \r\n    "], ["author_id", 11], ["created_at", "2020-02-03 23:38:52.361499"], ["updated_at", "2020-02-03 23:38:52.361499"]]

  def edit
    @post = Post.find_by(id: params[:id])
    @subs = Sub.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"