W8D1/sub-reddit/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "booooot"], ["description", "im on time always\r\n    \r\n    "], ["updated_at", "2020-02-04 00:21:17.114240"], ["id", 9]]
---
  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub && @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def require_author
    @sub = Sub.find_by(id: params[:id])