W11D3/BenchBnB/app/controllers/api/benches_controller.rb

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "nowhere"], ["lat", 37.01], ["lng", -122.3], ["created_at", "2020-02-28 00:54:29.420016"], ["updated_at", "2020-02-28 00:54:29.420016"]]
---
  def create
    @bench = Bench.new(bench_params)
    if @bench.save