W5D4/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "o5KkwSDrTSDlFn9exqUhqg"], ["LIMIT", 1]]
---
  def self.random_code
    short = SecureRandom::urlsafe_base64
    while self.exists?(short_url: short)

INSERT INTO "shortened_urls" ("long_url", "short_url", "created_at", "updated_at", "submitter_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def self.create_short_url(user, long)
    short = self.random_code
    self.create!(long_url: long, short_url: short, submitter_id: user.id)