W8D1/sub-reddit/reddit_clone/app/views/posts/edit.html.erb

      <label><%= sub.title %>
        <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>" <%if @post.sub_ids.include?(sub.id)%> checked <% end %>>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "post_shares" ON "subs"."id" = "post_shares"."sub_id" WHERE "post_shares"."post_id" = $1  [["post_id", 14]]