W8D1/sub-reddit/reddit_clone/app/views/posts/new.html.erb

      <label><%= sub.title %>
        <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>" <%if @post.sub_ids.include?(sub.id)%> checked <% end %>>
---
SELECT "subs".* FROM "subs"