W8D1/sub-reddit/reddit_clone/app/views/posts/show.html.erb

<ul>
  <% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_shares" ON "subs"."id" = "post_shares"."sub_id" WHERE "post_shares"."post_id" = $1  [["post_id", 14]]