W8D1/sub-reddit/reddit_clone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "post_shares" ON "posts"."id" = "post_shares"."post_id" WHERE "post_shares"."sub_id" = $1  [["sub_id", 5]]
---

  <% @sub.posts.each do |post| %>