W6D5/cats_99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "orange"], ["name", "TEST"], ["description", "TEST"], ["updated_at", "2020-01-25 00:39:27.492532"], ["id", 10]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)