W6D4/First/first_route/app/controllers/artworks_controller.rb

  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "lightningggg"], ["image_url", "lightningggg.com"], ["updated_at", "2020-01-23 18:40:28.436677"], ["id", 6]]