W6D4/First/first_route/app/controllers/comments_controller.rb

   def index
      if params.has_key?(:user_id)
        user = User.find(params[:user_id])
        render json: user.comments
      elsif params.has_key?(:artwork_id)
        artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

    def create
      comment = Comment.new(comment_params)
      if comment.save
---
INSERT INTO "comments" ("body", "commenter_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "\"lalalalala\""], ["commenter_id", 24], ["artwork_id", 22], ["created_at", "2020-01-23 21:34:21.788494"], ["updated_at", "2020-01-23 21:34:21.788494"]]