W6D4/First/first_route/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE (likeable_type = 'Artwork' AND likeable_id = '33')
SELECT "likes".* FROM "likes" WHERE (user_id = '33')
---
  def index
    if params.has_key?(:user_id)
      likes = Like.where('user_id = ?', "#{params[:user_id]}")
    elsif params.has_key?(:comment_id)
      likes = Like.where("likeable_type = 'Comment' AND likeable_id = ?", "#{params[:comment_id]}")
    elsif params.has_key?(:artwork_id)
      likes = Like.where("likeable_type = 'Artwork' AND likeable_id = ?", "#{params[:artwork_id]}")