W6D4/First/first_route/app/controllers/users_controller.rb

  def index
    if params.has_key?(:username)
      users = User.where('upper(username) LIKE ?', "%#{params[:username].upcase}%")
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "%e%"]]
SELECT "users".* FROM "users"

  def create
      user = User.new(user_params)
      if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-01-23 18:27:56.967768"], ["updated_at", "2020-01-23 18:27:56.967768"], ["username", "Olivia"]]